Autodesk.Revit.DB.DimensionType.SetOrdinateDimensionSetting(Autodesk.Revit.DB.OrdinateDimensionSetting)
Sets the ordinate dimension settings for this DimensionType.
ordinateDimSetting:
The new ordinate dimension settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DimensionType cannot be assigned ordinate dimension settings, as it is not a linear DimensionType or its Dimension String Type parameter is not set to Ordinate.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.SetEqualityFormula(System.Collections.Generic.IList{Autodesk.Revit.DB.DimensionEqualityLabelFormatting})
Sets an ordered list of the entries to use in the equality formula definition.
formattingArr:
An ordered list of the entries to use in the equality formula definition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input equality formula entries are not valid for use in the given DimensionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetSpecTypeId
Gets the spec of this dimension style.
Remarks:
The spec will represent either length, angle or slope.
Returns:
Identifier of the spec.

Autodesk.Revit.DB.DimensionType.SetUnitsFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class for the units value.
Remarks:
See the UnitType property to determine the unit type of this dimension style.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.SetAlternateUnitsFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Remarks:
See the UnitType property to determine the unit type of this dimension style.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DimensionType.Suffix
The suffix text for the dimension value.
Remarks:
The text goes immediately after the value and is not overridden by the possible instance suffix.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DimensionType.Prefix
The prefix text for the dimension value.
Remarks:
The text goes immediately before the value and is not overridden by the possible instance prefix.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DimensionType.AlternateUnitsSuffix
The suffix text for the alternate units value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.DimensionType.AlternateUnitsPrefix
The prefix text for the alternate units value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null